Revit 2026 API

# DesignToFabricationConverterSetMapForFamilySymbolToFabricationPartType Method

---
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DesignToFabricationMappingResult SetMapForFamilySymbolToFabricationPartType(
	IDictionary<ElementId, ElementId> typeMappings
)
```
```vb
Public Function SetMapForFamilySymbolToFabricationPartType (
	typeMappings As IDictionary(Of ElementId, ElementId)
) As DesignToFabricationMappingResult
```
```cpp
public:
DesignToFabricationMappingResult SetMapForFamilySymbolToFabricationPartType(
	IDictionary<ElementId^, ElementId^>^ typeMappings
)
```
```fsharp
member SetMapForFamilySymbolToFabricationPartType :
        typeMappings : IDictionary<ElementId, ElementId> -> DesignToFabricationMappingResult
```

#### Parameters

typeMappings IDictionaryElementId, ElementId

#### Return Value

DesignToFabricationMappingResult

#### Reference

DesignToFabricationConverter Class

Autodesk.Revit.DB.Fabrication Namespace